<?php

namespace Database\Seeders;

use App\Models\Chapter;
use Illuminate\Database\Seeder;


class ChapterSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $chapterTitles = [
            "Встреча с неизведанным",
            "Тайны старого мира",
            "Путешествие в прошлое",
            "Подземные лабиринты",
            "Сила волшебства",
            "Сражение за свободу",
            "По следам загадочного",
            "Темные предсказания",
            "Приключения в далеких землях",
            "Судьбоносный выбор",
            "Секреты древних текстов",
            "В поисках истины",
            "Спасение мира",
            "Свет и тьма",
            "Сквозь пространство и время",
            "Герои великих подвигов",
            "Загадочные сущности",
            "Огонь и лед",
            "Магия забытых времен",
        ];

        $chapters = [
            'С другой стороны рамки и место обучения кадров обеспечивает широкому кругу специалистов участие в формировании системы обучения кадров, соответствующей насущным потребностям. Соображения высшего порядка, а также консультация с профессионалами из IT играет важную роль в формировании дальнейших направлений развитая системы массового участия. Повседневная практика показывает, что курс на социально-ориентированный национальный проект способствует повышению актуальности модели развития! Таким образом, дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствующей насущным потребностям? С другой стороны реализация намеченного плана развития обеспечивает актуальность всесторонне сбалансированных нововведений? С другой стороны курс на социально-ориентированный национальный проект обеспечивает актуальность системы обучения кадров, соответствующей насущным потребностям! Дорогие друзья, выбранный нами инновационный путь создаёт предпосылки качественно новых шагов для ключевых компонентов планируемого обновления! Дорогие друзья, курс на социально-ориентированный национальный проект способствует подготовке и реализации соответствующих условий активизации! Повседневная практика показывает, что рамки и место обучения кадров в значительной степени обуславливает создание системы масштабного изменения ряда параметров. Значимость этих проблем настолько очевидна, что реализация намеченного плана развития играет важную роль в формировании форм воздействия. Практический опыт показывает, что рамки и место обучения кадров влечет за собой процесс внедрения и модернизации ключевых компонентов планируемого обновления.

            Задача организации, в особенности же реализация намеченного плана развития играет...0',
            'Практический опыт показывает, что рамки и место обучения кадров играет важную роль в формировании системы обучения кадров, соответствующей насущным потребностям. Равным образом новая модель организационной деятельности способствует повышению актуальности новых предложений! Равным образом постоянное информационно-техническое обеспечение нашей деятельности обеспечивает широкому кругу специалистов участие в формировании системы масштабного изменения ряда параметров. Дорогие друзья, курс на социально-ориентированный национальный проект позволяет выполнить важнейшие задания по разработке форм воздействия. Равным образом рамки и место обучения кадров создаёт предпосылки качественно новых шагов для системы обучения кадров, соответствующей насущным потребностям. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании системы обучения кадров, соответствующей насущным потребностям. Практический опыт показывает, что реализация намеченного плана развития напрямую зависит от соответствующих условий активизации! Не следует, однако, забывать о том, что начало повседневной работы по формированию позиции способствует повышению актуальности соответствующих условий активизации. Не следует, однако, забывать о том, что начало повседневной работы по формированию позиции требует определения и уточнения новых предложений? Равным образом постоянное информационно-техническое обеспечение нашей деятельности напрямую зависит от позиций, занимаемых участниками в отношении поставленных задач. С другой стороны рамки и место обучения кадров способствует подготовке и реализации модели развития.

            Дорогие...',
            'Значимость этих проблем настолько очевидна, что социально-экономическое развитие требует от нас системного анализа существующих финансовых и административных условий? Таким образом, дальнейшее развитие различных форм деятельности создаёт предпосылки качественно новых шагов для новых предложений. Дорогие друзья, начало повседневной работы по формированию позиции обеспечивает актуальность дальнейших направлений развития проекта? Равным образом постоянное информационно-техническое обеспечение нашей деятельности в значительной степени обуславливает создание модели развития! Дорогие друзья, новая модель организационной деятельности способствует повышению актуальности модели развития. Разнообразный и богатый опыт дальнейшее развитие различных форм деятельности создаёт предпосылки качественно новых шагов для дальнейших направлений развития проекта! Соображения высшего порядка, а также реализация намеченного плана развития способствует повышению актуальности дальнейших направлений развития проекта. Не следует, однако, забывать о том, что реализация намеченного плана развития в значительной степени обуславливает создание соответствующих условий активизации. С другой стороны социально-экономическое развитие влечет за собой процесс внедрения и модернизации системы масштабного изменения ряда параметров! Таким образом, рамки и место обучения кадров представляет собой интересный эксперимент проверки соответствующих условий активизации! Равным образом постоянный количественный рост и сфера нашей активности требует от нас системного анализа модели развития. Соображения высшего порядка, а также реализация намеченного плана развития способствует подготовке и реализации позиций, занимаемых участниками в отношении поставленных задач.

            Таким образом, постоянный количественный рост и...',
            'Повседневная практика показывает, что постоянное информационно-техническое обеспечение нашей деятельности способствует подготовке и реализации существующих финансовых и административных условий. С другой стороны постоянный количественный рост и сфера нашей активности играет важную роль в формировании модели развития. С другой стороны дальнейшее развитие различных форм деятельности способствует подготовке и реализации системы масштабного изменения ряда параметров. Дорогие друзья, реализация намеченного плана развития влечет за собой процесс внедрения и модернизации форм воздействия. Повседневная практика показывает, что постоянное информационно-техническое обеспечение нашей деятельности играет важную роль в формировании экономической целесообразности принимаемых решений! Задача организации, в особенности же рамки и место обучения кадров требует от нас анализа существующих финансовых и административных условий! Разнообразный и богатый опыт реализация намеченного плана развития требует определения и уточнения экономической целесообразности принимаемых решений. Задача организации, в особенности же курс на социально-ориентированный национальный проект позволяет выполнить важнейшие задания по разработке соответствующих условий активизации! Разнообразный и богатый опыт выбранный нами инновационный путь требует определения и уточнения новых предложений. Повседневная практика показывает, что реализация намеченного плана развития представляет собой интересный эксперимент проверки всесторонне сбалансированных нововведений! Задача организации, в особенности же повышение уровня гражданского сознания обеспечивает актуальность позиций, занимаемых участниками в отношении поставленных задач.

            Соображения высшего порядка, а также новая модель организационной деятельности позволяет оценить значение позиций,...',
            'Не следует, однако, забывать о том, что курс на социально-ориентированный национальный проект создаёт предпосылки качественно новых шагов для форм воздействия. Таким образом, постоянное информационно-техническое обеспечение нашей деятельности позволяет оценить значение модели развития. Не следует, однако, забывать о том, что постоянное информационно-техническое обеспечение нашей деятельности позволяет выполнить важнейшие задания по разработке существующих финансовых и административных условий? Таким образом, постоянное информационно-техническое обеспечение нашей деятельности требует от нас анализа системы обучения кадров, соответствующей насущным потребностям! Таким образом, реализация намеченного плана развития влечет за собой процесс внедрения и модернизации существующих финансовых и административных условий. Дорогие друзья, курс на социально-ориентированный национальный проект играет важную роль в формировании соответствующих условий активизации! Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности создаёт предпосылки качественно новых шагов для направлений прогрессивного развития. Задача организации, в особенности же курс на социально-ориентированный национальный проект играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны выбранный нами инновационный путь требует от нас анализа форм воздействия? Равным образом повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании существующих финансовых и административных условий! Повседневная практика показывает, что начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки дальнейших направлений развитая системы массового участия.

            Равным...'


        ];
        for ($i = 0; $i < 50; $i++) {

            Chapter::factory()->create([
                'title' => $chapterTitles[array_rand($chapterTitles)],
                'content' => $this->getChapterText($chapters),
                'book_id' => rand(1, 40),
                //'duration' => 1,
                //'characters' => 1,
                //'images' => 1
            ]);
        }
    }

    public function getChapterText($chapter)
    {
        $text = $chapter[array_rand($chapter)];
        for ($i = 0; $i < 50; $i++) {
            $text .= array_rand($chapter);
        }
        return $text;
    }
}
