<!-- 
TODO
    - нужно решить проблему с реагистрацией. Сейчас если уже кто-то авторизовался или если в бд уже создан токен, 
    то через постман невозможно еще раз зайти. Сбросить токен тоже не получится не зная токен из бд

    - Реализовать полноценную логику с подписками и платежкой

    - Нужно вынести всю бизнес логику в сервисы

    - Все сообщения должны подтягиваться из /resourses/lang/ru

    - Нужно сервисы правильно распределить по папкам. В Wrappers добавляем все сервисы обертки над библиотеками и сервисы для интеграций

    - Нужно добавить DTO

    - Необходимо исправить ошибку с телеграм ботом чтобы он не посылал бесконечно вебхуки в случае ошибок сервера
-->