<?php

return [

    'registration' => [
        'failed' => 'Не удалось зарегистрироваться.',
        'success' => 'Пользователь успешно зарегистрирован.',
    ],
    'login_success' => 'Пользователь успешно авторизован.',
    'logout_success' => 'Вы успешно вышли из аккаунта.',
    'invalid_credentials' => 'Неверный логин или пароль.',
    'user_not_found' => 'Пользователь не найден.',

    'register_success' => 'Пользователь успешно зарегистрирован.',
    'register_failed' => 'Не удалось зарегистрироваться',
    'login_success' => 'Пользователь успешно авторизован.',
    'logout_success' => 'Вы успешно вышли из аккаунта.',
    'invalid_credentials' => 'Неверные учетные данные.',
    'user_not_found' => 'Пользователь не найден.',
];
